dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxSpu_regdef.h
/** \brief Bin Rejection Unit Control */
typedef struct _Ifx_SPU_BINREJCTRL_Bits
{
    Ifx_UReg_32Bit RMODE:2;           /**< \brief [1:0] Bin Rejection Mode (rw) */
    Ifx_UReg_32Bit ZMODE:1;           /**< \brief [2:2] Threshold Rejection Mode (rw) */
    Ifx_UReg_32Bit LJUST:1;           /**< \brief [3:3] Left Justify (rw) */
    Ifx_UReg_32Bit VALUE:24;          /**< \brief [27:4] Threshold Value (rw) */
    Ifx_UReg_32Bit reserved_28:4;     /**< \brief [31:28] \internal Reserved */
} Ifx_SPU_BINREJCTRL_Bits;

/** \brief Bin Rejection Mask */
typedef struct _Ifx_SPU_BIN_REJ_Bits
{
    Ifx_UReg_32Bit B_R0:1;            /**< \brief [0:0] BIN (rw) */
    Ifx_UReg_32Bit B_R1:1;            /**< \brief [1:1] BIN (rw) */
    Ifx_UReg_32Bit B_R2:1;            /**< \brief [2:2] BIN (rw) */
    Ifx_UReg_32Bit B_R3:1;            /**< \brief [3:3] BIN (rw) */
    Ifx_UReg_32Bit B_R4:1;            /**< \brief [4:4] BIN (rw) */
    Ifx_UReg_32Bit B_R5:1;            /**< \brief [5:5] BIN (rw) */
    Ifx_UReg_32Bit B_R6:1;            /**< \brief [6:6] BIN (rw) */
    Ifx_UReg_32Bit B_R7:1;            /**< \brief [7:7] BIN (rw) */
    Ifx_UReg_32Bit B_R8:1;            /**< \brief [8:8] BIN (rw) */
    Ifx_UReg_32Bit B_R9:1;            /**< \brief [9:9] BIN (rw) */
    Ifx_UReg_32Bit B_R10:1;           /**< \brief [10:10] BIN (rw) */
    Ifx_UReg_32Bit B_R11:1;           /**< \brief [11:11] BIN (rw) */
    Ifx_UReg_32Bit B_R12:1;           /**< \brief [12:12] BIN (rw) */
    Ifx_UReg_32Bit B_R13:1;           /**< \brief [13:13] BIN (rw) */
    Ifx_UReg_32Bit B_R14:1;           /**< \brief [14:14] BIN (rw) */
    Ifx_UReg_32Bit B_R15:1;           /**< \brief [15:15] BIN (rw) */
    Ifx_UReg_32Bit B_R16:1;           /**< \brief [16:16] BIN (rw) */
    Ifx_UReg_32Bit B_R17:1;           /**< \brief [17:17] BIN (rw) */
    Ifx_UReg_32Bit B_R18:1;           /**< \brief [18:18] BIN (rw) */
    Ifx_UReg_32Bit B_R19:1;           /**< \brief [19:19] BIN (rw) */
    Ifx_UReg_32Bit B_R20:1;           /**< \brief [20:20] BIN (rw) */
    Ifx_UReg_32Bit B_R21:1;           /**< \brief [21:21] BIN (rw) */
    Ifx_UReg_32Bit B_R22:1;           /**< \brief [22:22] BIN (rw) */
    Ifx_UReg_32Bit B_R23:1;           /**< \brief [23:23] BIN (rw) */
    Ifx_UReg_32Bit B_R24:1;           /**< \brief [24:24] BIN (rw) */
    Ifx_UReg_32Bit B_R25:1;           /**< \brief [25:25] BIN (rw) */
    Ifx_UReg_32Bit B_R26:1;           /**< \brief [26:26] BIN (rw) */
    Ifx_UReg_32Bit B_R27:1;           /**< \brief [27:27] BIN (rw) */
    Ifx_UReg_32Bit B_R28:1;           /**< \brief [28:28] BIN (rw) */
    Ifx_UReg_32Bit B_R29:1;           /**< \brief [29:29] BIN (rw) */
    Ifx_UReg_32Bit B_R30:1;           /**< \brief [30:30] BIN (rw) */
    Ifx_UReg_32Bit B_R31:1;           /**< \brief [31:31] BIN (rw) */
} Ifx_SPU_BIN_REJ_Bits;

/** \brief Bin Rejection Unit Load Count */
typedef struct _Ifx_SPU_BRCNT_Bits
{
    Ifx_UReg_32Bit CNT:20;            /**< \brief [19:0] Access Count (rh) */
    Ifx_UReg_32Bit reserved_20:12;    /**< \brief [31:20] \internal Reserved */
} Ifx_SPU_BRCNT_Bits;

/** \brief CFAR Unit Load Count */
typedef struct _Ifx_SPU_CFARCNT_Bits
{
    Ifx_UReg_32Bit CNT:21;            /**< \brief [20:0] Access Count (rh) */
    Ifx_UReg_32Bit reserved_21:11;    /**< \brief [31:21] \internal Reserved */
} Ifx_SPU_CFARCNT_Bits;

/** \brief CFAR Configuration */
typedef struct _Ifx_SPU_CFAR_CFG1_Bits
{
    Ifx_UReg_32Bit CAALGO:2;          /**< \brief [1:0] CA-CFAR Algorithm Select (rw) */
    Ifx_UReg_32Bit GOSALGO:2;         /**< \brief [3:2] GOS-CFAR Algorithm Select (rw) */
    Ifx_UReg_32Bit CAGUARD:6;         /**< \brief [9:4] Guard Cells (rw) */
    Ifx_UReg_32Bit CAWINCELL:3;       /**< \brief [12:10] Window Cells Exponent (rw) */
    Ifx_UReg_32Bit reserved_13:1;     /**< \brief [13:13] \internal Reserved */
    Ifx_UReg_32Bit CFARSEL:2;         /**< \brief [15:14] Inline CFAR Engine (rw) */
    Ifx_UReg_32Bit CABETA:16;         /**< \brief [31:16] CA-CFAR Beta (rw) */
} Ifx_SPU_CFAR_CFG1_Bits;

/** \brief CFAR Configuration 2 */
typedef struct _Ifx_SPU_CFAR_CFG2_Bits
{
    Ifx_UReg_32Bit GOSGUARD:6;        /**< \brief [5:0] Guard Cells (rw) */
    Ifx_UReg_32Bit IDXLD:5;           /**< \brief [10:6] Index Lead (rw) */
    Ifx_UReg_32Bit IDXLG:5;           /**< \brief [15:11] Index Lag (rw) */
    Ifx_UReg_32Bit GOSWINCELL:6;      /**< \brief [21:16] Window Cells Exponent (rw) */
    Ifx_UReg_32Bit CASHWIN:3;         /**< \brief [24:22] CASH Subwindow (rw) */
    Ifx_UReg_32Bit reserved_25:7;     /**< \brief [31:25] \internal Reserved */
} Ifx_SPU_CFAR_CFG2_Bits;

/** \brief CFAR Configuration 3 */
typedef struct _Ifx_SPU_CFAR_CFG3_Bits
{
    Ifx_UReg_32Bit GOSBETA:16;        /**< \brief [15:0] GOS-CFAR Beta (rw) */
    Ifx_UReg_32Bit CHAN5OFFST:16;     /**< \brief [31:16] Channel 5 Address Offset (rw) */
} Ifx_SPU_CFAR_CFG3_Bits;

/** \brief Clock Control */
typedef struct _Ifx_SPU_CLC_Bits
{
    Ifx_UReg_32Bit DISR:1;            /**< \brief [0:0] Disable Request (rw) */
    Ifx_UReg_32Bit DISS:1;            /**< \brief [1:1] Disable Status (rh) */
    Ifx_UReg_32Bit FDIS:1;            /**< \brief [2:2] Freeze Disable (rw) */
    Ifx_UReg_32Bit EDIS:1;            /**< \brief [3:3] Sleep Mode Enable Control (rw) */
    Ifx_UReg_32Bit reserved_4:28;     /**< \brief [31:4] \internal Reserved */
} Ifx_SPU_CLC_Bits;

/** \brief Safety Counter Clear */
typedef struct _Ifx_SPU_CNTCLR_Bits
{
    Ifx_UReg_32Bit CLR:2;             /**< \brief [1:0] Clear (rwh) */
    Ifx_UReg_32Bit reserved_2:14;     /**< \brief [15:2] \internal Reserved */
    Ifx_UReg_32Bit CNTTST:2;          /**< \brief [17:16] Monitor Counter Test (rwh) */
    Ifx_UReg_32Bit SELECT:5;          /**< \brief [22:18] Counter Select (rw) */
    Ifx_UReg_32Bit reserved_23:9;     /**< \brief [31:23] \internal Reserved */
} Ifx_SPU_CNTCLR_Bits;

/** \brief Monitor CRC Register */
typedef struct _Ifx_SPU_CRC_CTRL_Bits
{
    Ifx_UReg_32Bit CRC:32;            /**< \brief [31:0] CRC (rh) */
} Ifx_SPU_CRC_CTRL_Bits;

/** \brief Monitor CRC Register */
typedef struct _Ifx_SPU_CRC_DATA_Bits
{
    Ifx_UReg_32Bit CRC:32;            /**< \brief [31:0] CRC (rh) */
} Ifx_SPU_CRC_DATA_Bits;

