dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxSpu_regdef.h
/** \brief OCDS Debug Access Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SPU_ODA_Bits B;               /**< \brief Bitfield access */
} Ifx_SPU_ODA;

/** \brief Output DMA Port Write Count   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SPU_ODMACNT_Bits B;           /**< \brief Bitfield access */
} Ifx_SPU_ODMACNT;

/** \brief Output Buffer Memory Read Count   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SPU_ODMCNT_Bits B;            /**< \brief Bitfield access */
} Ifx_SPU_ODMCNT;

/** \brief Partial-Acquisition Counter   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SPU_PACTR_Bits B;             /**< \brief Bitfield access */
} Ifx_SPU_PACTR;

/** \brief Register CRC   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SPU_REGCRC_Bits B;            /**< \brief Bitfield access */
} Ifx_SPU_REGCRC;

/** \brief Scalar Addition Operand   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SPU_SCALARADD_Bits B;         /**< \brief Bitfield access */
} Ifx_SPU_SCALARADD;

/** \brief Scalar Multiplication Operand   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SPU_SCALARMULT_Bits B;        /**< \brief Bitfield access */
} Ifx_SPU_SCALARMULT;

/** \brief Safety Mechanism Control Functions   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SPU_SMCTRL_Bits B;            /**< \brief Bitfield access */
} Ifx_SPU_SMCTRL;

/** \brief Safety Mechanism Status   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SPU_SMSTAT_Bits B;            /**< \brief Bitfield access */
} Ifx_SPU_SMSTAT;

/** \brief Safety Mechanism Control Functions (User)   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SPU_SMUSER_Bits B;            /**< \brief Bitfield access */
} Ifx_SPU_SMUSER;

/** \brief Status and Reporting   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SPU_STAT_Bits B;              /**< \brief Bitfield access */
} Ifx_SPU_STAT;

/** \brief Output Buffer Memory Write Count   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SPU_ULDRCNT_Bits B;           /**< \brief Bitfield access */
} Ifx_SPU_ULDRCNT;

/** \brief User OCDS Trace Control   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SPU_USROTC_Bits B;            /**< \brief Bitfield access */
} Ifx_SPU_USROTC;

/** \}  */

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Spu_ID_struct
 * \{  */
/******************************************************************************/
/** \name Object L2
 * \{  */
/** \brief ID object */
typedef volatile struct _Ifx_SPU_ID
{
       Ifx_SPU_ID_CONF                     CONF;                   /**< \brief 0, Input DMA Configuration*/
       Ifx_SPU_ID_CONF2                    CONF2;                  /**< \brief 4, Input DMA Configuration 2*/
       Ifx_SPU_ID_RM_CONF                  RM_CONF;                /**< \brief 8, Input DMA Configuration: Radar Memory*/
       Ifx_SPU_ID_RM_ILO                   RM_ILO;                 /**< \brief C, Inner Loop Address Offset*/
       Ifx_SPU_ID_RM_OLO                   RM_OLO;                 /**< \brief 10, Outer Loop Address Offset*/
       Ifx_SPU_ID_RM_BLO                   RM_BLO;                 /**< \brief 14, Bin Offset Address Configuration*/
       Ifx_SPU_ID_RM_IOLR                  RM_IOLR;                /**< \brief 18, Inner and Outer Loop Repeat*/
       Ifx_SPU_ID_RM_BLR                   RM_BLR;                 /**< \brief 1C, Bin Loop Repeat*/
       Ifx_SPU_ID_RM_ACFG0                 RM_ACFG0;               /**< \brief 20, Spare Configuration Register*/
       Ifx_SPU_ID_RM_ACFG1                 RM_ACFG1;               /**< \brief 24, Spare Configuration Register*/
} Ifx_SPU_ID;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Spu_BE_struct
 * \{  */
/******************************************************************************/
/** \name Object L2
 * \{  */
/** \brief BE object */
typedef volatile struct _Ifx_SPU_BE
{
       Ifx_SPU_BE_LDR_CONF                 LDR_CONF;               /**< \brief 0, Loader Configuration*/
       Ifx_SPU_BE_LDR_CONF2                LDR_CONF2;              /**< \brief 4, Loader Configuration Extended*/
       Ifx_SPU_BE_ANTOFST                  ANTOFST[4];             /**< \brief 8, Antenna Offset*/
       Ifx_SPU_BE_UNLDR_CONF               UNLDR_CONF;             /**< \brief 18, Unloader Configuration*/
       Ifx_SPU_BE_UNLDR_CONF2              UNLDR_CONF2;            /**< \brief 1C, Unloader Configuration 2*/
       Ifx_SPU_BE_UNLDR_ACFG               UNLDR_ACFG;             /**< \brief 20, Spare Configuration Register*/
       Ifx_SPU_BE_ODP_CONF                 ODP_CONF;               /**< \brief 24, Output Data Processor Configuration*/
       Ifx_SPU_BE_NCICTRL                  NCICTRL;                /**< \brief 28, NCI Control*/
       Ifx_SPU_BE_SUMCTRL                  SUMCTRL;                /**< \brief 2C, Summation Unit Control*/
       Ifx_SPU_BE_PWRSUM                   PWRSUM;                 /**< \brief 30, Power Summation*/
       Ifx_SPU_BE_PWRCTRL                  PWRCTRL;                /**< \brief 34, Power Information Channel Control*/
       Ifx_SPU_BE_CFARCTRL                 CFARCTRL;               /**< \brief 38, CFAR Module Control*/
       Ifx_SPU_BE_SBCTRL                   SBCTRL;                 /**< \brief 3C, Sideband Control*/
} Ifx_SPU_BE;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Spu_NCI_struct
 * \{  */
/******************************************************************************/
/** \name Object L2
 * \{  */
/** \brief NCI object */
typedef volatile struct _Ifx_SPU_NCI
{
       Ifx_SPU_NCI_SCALAR0                 SCALAR0;                /**< \brief 0, NCI Antennae Scaling Factor*/
       Ifx_SPU_NCI_SCALAR1                 SCALAR1;                /**< \brief 4, NCI Antennae Scaling Factor*/
       Ifx_SPU_NCI_SCALAR2                 SCALAR2;                /**< \brief 8, NCI Antennae Scaling Factor*/
       Ifx_SPU_NCI_SCALAR3                 SCALAR3;                /**< \brief C, NCI Antennae Scaling Factor*/
} Ifx_SPU_NCI;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Spu_CFAR_struct
 * \{  */
/******************************************************************************/
/** \name Object L2
 * \{  */
/** \brief CFAR object */
typedef volatile struct _Ifx_SPU_CFAR
{
       Ifx_SPU_CFAR_CFG1                   CFG1;                   /**< \brief 0, CFAR Configuration*/
       Ifx_SPU_CFAR_CFG2                   CFG2;                   /**< \brief 4, CFAR Configuration 2*/
       Ifx_SPU_CFAR_CFG3                   CFG3;                   /**< \brief 8, CFAR Configuration 3*/
} Ifx_SPU_CFAR;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Spu_MD_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief MD object */
typedef volatile struct _Ifx_SPU_MD
{
       Ifx_SPU_MD_METADATA                 METADATA;               /**< \brief 0, Dataset Metadata*/
       Ifx_SPU_MD_BINCOUNT                 BINCOUNT;               /**< \brief 4, Bin Rejection Unit Tracking*/
       Ifx_SPU_MD_MASK_ACCEPT              MASK_ACCEPT[32];        /**< \brief 8, Bin Acceptance  Mask*/
} Ifx_SPU_MD;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Spu_CRC_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief CRC object */
typedef volatile struct _Ifx_SPU_CRC
{
       Ifx_SPU_CRC_DATA                    DATA[86];               /**< \brief 0, Monitor CRC Register*/
       Ifx_UReg_8Bit                       reserved_158[32];       /**< \brief 158, \internal Reserved */
       Ifx_SPU_CRC_CTRL                    CTRL[25];               /**< \brief 178, Monitor CRC Register*/
} Ifx_SPU_CRC;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/** \addtogroup IfxSfr_Spu_Registers_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief SPU object */
typedef volatile struct _Ifx_SPU
{
       Ifx_SPU_CLC                         CLC;                    /**< \brief 0, Clock Control*/
       Ifx_SPU_MODID                       MODID;                  /**< \brief 4, Module Identification Register*/
       Ifx_SPU_STAT                        STAT;                   /**< \brief 8, Status and Reporting*/
       Ifx_UReg_8Bit                       reserved_C[20];         /**< \brief C, \internal Reserved */
       Ifx_UReg_8Bit                       reserved_20[16];        /**< \brief 20, \internal Reserved */
       Ifx_SPU_ID                          ID;                     /**< \brief 30, Spare Configuration Register*/
       Ifx_SPU_PACTR                       PACTR;                  /**< \brief 58, Partial-Acquisition Counter*/
       Ifx_SPU_DPASS_CONF                  DPASS_CONF;             /**< \brief 5C, Double Pass Configuration*/
       Ifx_SPU_BE                          BE[2];                  /**< \brief 60, Sideband Control*/
       Ifx_SPU_BIN_REJ                     BIN_REJ[64];            /**< \brief E0, Bin Rejection Mask*/
       Ifx_SPU_MAGAPPROX                   MAGAPPROX;              /**< \brief 1E0, Magnitude Approximation Constants*/
       Ifx_SPU_NCI                         NCI;                    /**< \brief 1E4, NCI Antennae Scaling Factor*/
       Ifx_SPU_CFAR                        CFAR[1];                /**< \brief 1F4, CFAR Configuration 3*/
       Ifx_SPU_SCALARADD                   SCALARADD;              /**< \brief 200, Scalar Addition Operand*/
       Ifx_SPU_SCALARMULT                  SCALARMULT;             /**< \brief 204, Scalar Multiplication Operand*/
       Ifx_SPU_BINREJCTRL                  BINREJCTRL;             /**< \brief 208, Bin Rejection Unit Control*/
       Ifx_SPU_LCLMAX                      LCLMAX;                 /**< \brief 20C, Local Maximum Control*/
       Ifx_SPU_ACFG2                       ACFG2;                  /**< \brief 210, Spare Configuration Register*/
       Ifx_UReg_8Bit                       reserved_214[4];        /**< \brief 214, \internal Reserved */
       Ifx_SPU_REGCRC                      REGCRC;                 /**< \brief 218, Register CRC*/
       Ifx_SPU_CTRL                        CTRL;                   /**< \brief 21C, SPU Control*/
       Ifx_SPU_MD                          MD[2];                  /**< \brief 220, Bin Acceptance Mask*/
       Ifx_SPU_IDMCNT                      IDMCNT;                 /**< \brief 330, Input DMA Count*/
       Ifx_SPU_IBMCNT                      IBMCNT;                 /**< \brief 334, Input Buffer Memory Count*/
       Ifx_SPU_LDRCNT                      LDRCNT;                 /**< \brief 338, Input Buffer Memory Read Count*/
       Ifx_SPU_FFTWCNT                     FFTWCNT;                /**< \brief 33C, FFT Load Count*/
       Ifx_SPU_FFTRCNT                     FFTRCNT;                /**< \brief 340, FFT Unload Count*/
       Ifx_SPU_ULDRCNT                     ULDRCNT;                /**< \brief 344, Output Buffer Memory Write Count*/
       Ifx_SPU_ODMCNT                      ODMCNT;                 /**< \brief 348, Output Buffer Memory Read Count*/
       Ifx_SPU_BRCNT                       BRCNT;                  /**< \brief 34C, Bin Rejection Unit Load Count*/
       Ifx_SPU_CFARCNT                     CFARCNT;                /**< \brief 350, CFAR Unit Load Count*/
       Ifx_SPU_ODMACNT                     ODMACNT[8];             /**< \brief 354, Output DMA Port Write Count*/
       Ifx_SPU_CNTCLR                      CNTCLR;                 /**< \brief 374, Safety Counter Clear*/
       Ifx_SPU_MONITOR                     MONITOR;                /**< \brief 378, SPU Monitor*/
       Ifx_SPU_SMCTRL                      SMCTRL;                 /**< \brief 37C, Safety Mechanism Control Functions*/
       Ifx_SPU_SMSTAT                      SMSTAT;                 /**< \brief 380, Safety Mechanism Status*/
       Ifx_SPU_SMUSER                      SMUSER;                 /**< \brief 384, Safety Mechanism Control Functions (User)*/
       Ifx_SPU_CRC                         CRC;                    /**< \brief 388, Control CRC*/
       Ifx_UReg_8Bit                       reserved_564[636];      /**< \brief 564, \internal Reserved */
       Ifx_SPU_USROTC                      USROTC;                 /**< \brief 7E0, User OCDS Trace Control*/
       Ifx_SPU_ACCEN0                      ACCEN0;                 /**< \brief 7E4, Access Enable Register 0*/
       Ifx_SPU_ACCEN1                      ACCEN1;                 /**< \brief 7E8, Access Enable Register 1*/
       Ifx_SPU_OCS                         OCS;                    /**< \brief 7EC, OCDS Control and Status*/
       Ifx_SPU_ODA                         ODA;                    /**< \brief 7F0, OCDS Debug Access Register*/
       Ifx_SPU_KRST0                       KRST0;                  /**< \brief 7F4, Kernel Reset Register 0*/
       Ifx_SPU_KRST1                       KRST1;                  /**< \brief 7F8, Kernel Reset Register 1*/
       Ifx_SPU_KRSTCLR                     KRSTCLR;                /**< \brief 7FC, Kernel Reset Clear*/
} Ifx_SPU;

/** \}  */
/******************************************************************************/
/** \}  */


/******************************************************************************/

/******************************************************************************/

#endif /* IFXSPU_REGDEF_H */
